todo/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "dfsdfsdf"], ["created_at", "2023-05-01 14:22:20.487486"], ["updated_at", "2023-05-01 14:22:20.487486"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "task 2"], ["updated_at", "2023-05-01 14:22:59.498028"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)